## Terraform Plan

**Images:**
- DSP Agent: `87b2f65`
- Research Agent: `87b2f65`
- Coding Agent: `87b2f65`
- MCP Server: `87b2f65`

<details>
<summary>Show Plan</summary>

```
module.code_interpreter[0].data.aws_caller_identity.current: Reading...
module.code_interpreter[0].data.aws_region.current: Reading...
aws_ecr_repository.mcp_server: Refreshing state... [id=iker-agents/mcp-server]
aws_ecr_repository.agent: Refreshing state... [id=iker-agents/dsp-agent]
data.aws_region.current: Reading...
module.code_interpreter[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_ecr_repository.coding_agent: Refreshing state... [id=iker-agents/coding-agent]
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Reading...
aws_ecr_repository.research_agent: Refreshing state... [id=iker-agents/research-agent]
aws_cognito_user_pool.main[0]: Refreshing state... [id=us-east-1_0Och8G0S2]
module.code_interpreter[0].data.aws_caller_identity.current: Read complete after 0s [id=239388734812]
module.code_interpreter[0].aws_iam_role.code_interpreter: Refreshing state... [id=coding_agent_interpreter-code-interpreter-role]
data.aws_caller_identity.current: Read complete after 0s [id=239388734812]
aws_ecr_lifecycle_policy.agent: Refreshing state... [id=iker-agents/dsp-agent]
aws_ecr_lifecycle_policy.coding_agent: Refreshing state... [id=iker-agents/coding-agent]
module.mcp_server[0].data.aws_caller_identity.current: Reading...
module.mcp_server[0].data.aws_region.current: Reading...
aws_ecr_lifecycle_policy.mcp_server: Refreshing state... [id=iker-agents/mcp-server]
module.mcp_server[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.mcp_server[0].aws_iam_role.runtime: Refreshing state... [id=agentcore_mcp-runtime-role]
module.research_agent[0].data.aws_caller_identity.current: Reading...
aws_ecr_lifecycle_policy.research_agent: Refreshing state... [id=iker-agents/research-agent]
module.research_agent[0].data.aws_iam_policy_document.xray: Reading...
module.research_agent[0].data.aws_iam_policy_document.xray: Read complete after 0s [id=1756567564]
module.research_agent[0].data.aws_iam_policy_document.cloudwatch_logs: Reading...
module.research_agent[0].data.aws_iam_policy_document.cloudwatch_logs: Read complete after 0s [id=3253318109]
module.research_agent[0].data.aws_iam_policy_document.bedrock_invoke: Reading...
module.research_agent[0].data.aws_iam_policy_document.bedrock_invoke: Read complete after 0s [id=1713947774]
module.research_agent[0].data.aws_iam_policy_document.runtime_assume_role: Reading...
module.research_agent[0].data.aws_iam_policy_document.runtime_assume_role: Read complete after 0s [id=4217861921]
module.research_agent[0].data.aws_iam_policy_document.ecr_pull: Reading...
module.research_agent[0].data.aws_iam_policy_document.ecr_pull: Read complete after 0s [id=3988369881]
module.research_agent[0].data.aws_region.current: Reading...
module.research_agent[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.research_agent[0].aws_bedrockagentcore_memory.this: Refreshing state... [id=research_agent_tf_memory-TFY1NtEPcq]
module.mcp_server[0].data.aws_caller_identity.current: Read complete after 0s [id=239388734812]
module.research_agent[0].aws_iam_role.runtime: Refreshing state... [id=research-agent-tf-runtime-role]
module.research_agent[0].data.aws_caller_identity.current: Read complete after 0s [id=239388734812]
module.research_agent[0].data.aws_iam_policy_document.lambda_invoke: Reading...
module.research_agent[0].data.aws_iam_policy_document.lambda_invoke: Read complete after 0s [id=2150515099]
module.code_interpreter[0].aws_iam_role_policy.code_interpreter: Refreshing state... [id=coding_agent_interpreter-code-interpreter-role:code-interpreter-execution]
module.code_interpreter[0].aws_bedrockagentcore_code_interpreter.this: Refreshing state... [name=coding_agent_interpreter]
aws_cognito_user_pool_domain.main[0]: Refreshing state... [id=agent-ui-tf-239388734812]
aws_cognito_user_pool_client.main[0]: Refreshing state... [id=km1gk1jcpoud4j029bverljba]
module.mcp_server[0].aws_iam_role_policy.runtime_execution: Refreshing state... [id=agentcore_mcp-runtime-role:runtime-execution]
module.mcp_server[0].aws_bedrockagentcore_agent_runtime.mcp_server: Refreshing state...
module.research_agent[0].data.aws_iam_policy_document.memory_access: Reading...
module.research_agent[0].data.aws_iam_policy_document.memory_access: Read complete after 0s [id=4066590296]
module.coding_agent[0].data.aws_iam_policy_document.cloudwatch_logs: Reading...
module.coding_agent[0].data.aws_caller_identity.current: Reading...
module.coding_agent[0].data.aws_iam_policy_document.runtime_assume_role: Reading...
module.coding_agent[0].data.aws_region.current: Reading...
module.coding_agent[0].data.aws_iam_policy_document.xray: Reading...
module.coding_agent[0].data.aws_iam_policy_document.bedrock_invoke: Reading...
module.coding_agent[0].data.aws_iam_policy_document.cloudwatch_logs: Read complete after 0s [id=3253318109]
module.coding_agent[0].data.aws_iam_policy_document.ecr_pull: Reading...
module.coding_agent[0].aws_bedrockagentcore_memory.this: Refreshing state... [id=coding_agent_tf_memory-FDMkt3BwtE]
module.coding_agent[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.coding_agent[0].data.aws_iam_policy_document.runtime_assume_role: Read complete after 0s [id=4217861921]
module.coding_agent[0].data.aws_iam_policy_document.xray: Read complete after 0s [id=1756567564]
module.coding_agent[0].data.aws_iam_policy_document.bedrock_invoke: Read complete after 0s [id=1713947774]
module.coding_agent[0].data.aws_iam_policy_document.ecr_pull: Read complete after 0s [id=3988369881]
module.coding_agent[0].aws_iam_role.runtime: Refreshing state... [id=coding-agent-tf-runtime-role]
module.coding_agent[0].data.aws_caller_identity.current: Read complete after 0s [id=239388734812]
module.coding_agent[0].data.aws_iam_policy_document.lambda_invoke: Reading...
module.coding_agent[0].data.aws_iam_policy_document.lambda_invoke: Read complete after 0s [id=2150515099]
module.mcp_server[0].aws_bedrockagentcore_agent_runtime_endpoint.mcp_server: Refreshing state... [name=default]
module.research_agent[0].aws_iam_role_policy.ecr_pull: Refreshing state... [id=research-agent-tf-runtime-role:ecr-pull]
module.research_agent[0].aws_iam_role_policy.bedrock_invoke: Refreshing state... [id=research-agent-tf-runtime-role:bedrock-invoke]
module.research_agent[0].aws_iam_role_policy.lambda_invoke: Refreshing state... [id=research-agent-tf-runtime-role:lambda-invoke]
module.research_agent[0].aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=research-agent-tf-runtime-role:cloudwatch-logs]
module.research_agent[0].aws_iam_role_policy.memory_access: Refreshing state... [id=research-agent-tf-runtime-role:memory-access]
module.research_agent[0].aws_iam_role_policy.xray: Refreshing state... [id=research-agent-tf-runtime-role:xray-tracing]
module.research_agent[0].aws_bedrockagentcore_agent_runtime.this: Refreshing state...
module.dsp_agent.aws_bedrockagentcore_memory.this: Refreshing state... [id=dsp_agent_tf_memory-lRHahyCGis]
module.dsp_agent.aws_iam_role.runtime: Refreshing state... [id=dsp-agent-tf-runtime-role]
module.coding_agent[0].data.aws_iam_policy_document.memory_access: Reading...
module.coding_agent[0].data.aws_iam_policy_document.memory_access: Read complete after 0s [id=725962732]
module.coding_agent[0].aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=coding-agent-tf-runtime-role:cloudwatch-logs]
module.coding_agent[0].aws_iam_role_policy.lambda_invoke: Refreshing state... [id=coding-agent-tf-runtime-role:lambda-invoke]
module.coding_agent[0].aws_iam_role_policy.ecr_pull: Refreshing state... [id=coding-agent-tf-runtime-role:ecr-pull]
module.coding_agent[0].aws_iam_role_policy.xray: Refreshing state... [id=coding-agent-tf-runtime-role:xray-tracing]
module.coding_agent[0].aws_iam_role_policy.bedrock_invoke: Refreshing state... [id=coding-agent-tf-runtime-role:bedrock-invoke]
module.coding_agent[0].aws_iam_role_policy.code_interpreter[0]: Refreshing state... [id=coding-agent-tf-runtime-role:code-interpreter]
module.coding_agent[0].aws_iam_role_policy.memory_access: Refreshing state... [id=coding-agent-tf-runtime-role:memory-access]
module.research_agent[0].aws_bedrockagentcore_agent_runtime_endpoint.this["prod"]: Refreshing state... [name=prod]
module.research_agent[0].aws_bedrockagentcore_agent_runtime_endpoint.this["canary"]: Refreshing state... [name=canary]
module.research_agent[0].aws_bedrockagentcore_agent_runtime_endpoint.this["dev"]: Refreshing state... [name=dev]
module.coding_agent[0].aws_bedrockagentcore_agent_runtime.this: Refreshing state...
module.dsp_agent.aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=dsp-agent-tf-runtime-role:cloudwatch-logs]
module.dsp_agent.aws_iam_role_policy.lambda_invoke: Refreshing state... [id=dsp-agent-tf-runtime-role:lambda-invoke]
module.dsp_agent.aws_iam_role_policy.ecr_pull: Refreshing state... [id=dsp-agent-tf-runtime-role:ecr-pull]
module.dsp_agent.aws_iam_role_policy.xray: Refreshing state... [id=dsp-agent-tf-runtime-role:xray-tracing]
module.dsp_agent.aws_iam_role_policy.memory_access: Refreshing state... [id=dsp-agent-tf-runtime-role:memory-access]
module.dsp_agent.aws_iam_role_policy.bedrock_invoke: Refreshing state... [id=dsp-agent-tf-runtime-role:bedrock-invoke]
module.dsp_agent.aws_iam_role_policy.invoke_mcp_server[0]: Refreshing state... [id=dsp-agent-tf-runtime-role:invoke-mcp-server]
module.dsp_agent.aws_bedrockagentcore_agent_runtime.this: Refreshing state...
module.coding_agent[0].aws_bedrockagentcore_agent_runtime_endpoint.this["prod"]: Refreshing state... [name=prod]
module.coding_agent[0].aws_bedrockagentcore_agent_runtime_endpoint.this["dev"]: Refreshing state... [name=dev]
module.coding_agent[0].aws_bedrockagentcore_agent_runtime_endpoint.this["canary"]: Refreshing state... [name=canary]
module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["dev"]: Refreshing state... [name=dev]
module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["canary"]: Refreshing state... [name=canary]
module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["prod"]: Refreshing state... [name=prod]
module.ui[0].aws_iam_role.lambda: Refreshing state... [id=agent-ui-tf-lambda-role]
module.ui[0].aws_s3_bucket.ui: Refreshing state... [id=agent-ui-tf-239388734812]
module.ui[0].aws_iam_role_policy.lambda_logs: Refreshing state... [id=agent-ui-tf-lambda-role:lambda-logs]
module.ui[0].aws_iam_role_policy.lambda_agentcore: Refreshing state... [id=agent-ui-tf-lambda-role:agentcore-invoke]
module.ui[0].aws_lambda_function.proxy: Refreshing state... [id=agent-ui-tf-proxy]
module.ui[0].aws_s3_bucket_public_access_block.ui: Refreshing state... [id=agent-ui-tf-239388734812]
module.ui[0].aws_s3_bucket_website_configuration.ui: Refreshing state... [id=agent-ui-tf-239388734812]
module.ui[0].aws_s3_bucket_policy.ui: Refreshing state... [id=agent-ui-tf-239388734812]
module.ui[0].aws_cloudfront_distribution.ui: Refreshing state... [id=E1N79FYP07LOK]
module.ui[0].aws_apigatewayv2_api.api: Refreshing state... [id=t042pm32d2]
module.ui[0].aws_apigatewayv2_integration.lambda: Refreshing state... [id=6q0hy02]
module.ui[0].aws_apigatewayv2_authorizer.jwt[0]: Refreshing state... [id=twa4ac]
module.ui[0].aws_lambda_permission.api: Refreshing state... [id=AllowAPIGateway]
module.ui[0].aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.ui[0].aws_apigatewayv2_route.agents: Refreshing state... [id=sfe4rqh]
module.ui[0].aws_apigatewayv2_route.invoke: Refreshing state... [id=biyutvd]
null_resource.update_cognito_callbacks[0]: Refreshing state... [id=5822675665405264724]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.coding_agent[0].aws_bedrockagentcore_agent_runtime.this will be updated in-place
  ~ resource "aws_bedrockagentcore_agent_runtime" "this" {
      ~ agent_runtime_version     = "12" -> (known after apply)
        tags                      = {
            "Agent"     = "coding-agent-tf"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (10 unchanged attributes hidden)

      ~ agent_runtime_artifact {
          ~ container_configuration {
              ~ container_uri = "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/coding-agent:da86209" -> "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/coding-agent:87b2f65"
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.dsp_agent.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.dsp_agent.data.aws_iam_policy_document.bedrock_invoke will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "bedrock_invoke" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "bedrock:InvokeModel",
              + "bedrock:InvokeModelWithResponseStream",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:bedrock:*:*:inference-profile/*",
              + "arn:aws:bedrock:*::foundation-model/*",
            ]
        }
    }

  # module.dsp_agent.data.aws_iam_policy_document.cloudwatch_logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cloudwatch_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.dsp_agent.data.aws_iam_policy_document.ecr_pull will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecr_pull" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.dsp_agent.data.aws_iam_policy_document.lambda_invoke will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_invoke" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.dsp_agent.data.aws_iam_policy_document.memory_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "memory_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "bedrock-agentcore:GetMemoryRecord",
              + "bedrock-agentcore:ListActors",
              + "bedrock-agentcore:ListMemoryRecords",
              + "bedrock-agentcore:ListSessions",
              + "bedrock-agentcore:RetrieveMemoryRecords",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:bedrock-agentcore:us-east-1:239388734812:memory/dsp_agent_tf_memory-lRHahyCGis",
            ]
        }
      + statement {
          + actions   = [
              + "bedrock-agentcore:GetEvent",
              + "bedrock-agentcore:ListActors",
              + "bedrock-agentcore:ListEvents",
              + "bedrock-agentcore:ListSessions",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:bedrock-agentcore:us-east-1:239388734812:memory/dsp_agent_tf_memory-lRHahyCGis",
            ]
        }
      + statement {
          + actions   = [
              + "bedrock-agentcore:CreateEvent",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:bedrock-agentcore:us-east-1:239388734812:memory/dsp_agent_tf_memory-lRHahyCGis",
            ]
        }
    }

  # module.dsp_agent.data.aws_iam_policy_document.runtime_assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "runtime_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "bedrock-agentcore.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.dsp_agent.data.aws_iam_policy_document.xray will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "xray" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.dsp_agent.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.dsp_agent.aws_bedrockagentcore_agent_runtime.this will be updated in-place
  ~ resource "aws_bedrockagentcore_agent_runtime" "this" {
      ~ agent_runtime_version     = "47" -> (known after apply)
      ~ environment_variables     = {
          ~ "AWS_REGION"     = "us-east-1" -> (known after apply)
            # (4 unchanged elements hidden)
        }
        tags                      = {
            "Agent"     = "dsp-agent-tf"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (9 unchanged attributes hidden)

      ~ agent_runtime_artifact {
          ~ container_configuration {
              ~ container_uri = "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/dsp-agent:da86209" -> "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/dsp-agent:87b2f65"
            }
        }

      ~ authorizer_configuration {
          ~ custom_jwt_authorizer {
              ~ discovery_url   = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_0Och8G0S2/.well-known/openid-configuration" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.dsp_agent.aws_iam_role.runtime will be updated in-place
  ~ resource "aws_iam_role" "runtime" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "bedrock-agentcore.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "dsp-agent-tf-runtime-role"
        name                  = "dsp-agent-tf-runtime-role"
        tags                  = {
            "Agent"     = "dsp-agent-tf"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (8 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.dsp_agent.aws_iam_role_policy.bedrock_invoke will be updated in-place
  ~ resource "aws_iam_role_policy" "bedrock_invoke" {
        id     = "dsp-agent-tf-runtime-role:bedrock-invoke"
        name   = "bedrock-invoke"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "bedrock:InvokeModelWithResponseStream",
                          - "bedrock:InvokeModel",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:bedrock:*::foundation-model/*",
                          - "arn:aws:bedrock:*:*:inference-profile/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dsp_agent.aws_iam_role_policy.cloudwatch_logs will be updated in-place
  ~ resource "aws_iam_role_policy" "cloudwatch_logs" {
        id     = "dsp-agent-tf-runtime-role:cloudwatch-logs"
        name   = "cloudwatch-logs"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dsp_agent.aws_iam_role_policy.ecr_pull will be updated in-place
  ~ resource "aws_iam_role_policy" "ecr_pull" {
        id     = "dsp-agent-tf-runtime-role:ecr-pull"
        name   = "ecr-pull"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dsp_agent.aws_iam_role_policy.lambda_invoke will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_invoke" {
        id     = "dsp-agent-tf-runtime-role:lambda-invoke"
        name   = "lambda-invoke"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:us-east-1:239388734812:function:agentcore-mcp-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dsp_agent.aws_iam_role_policy.memory_access will be updated in-place
  ~ resource "aws_iam_role_policy" "memory_access" {
        id     = "dsp-agent-tf-runtime-role:memory-access"
        name   = "memory-access"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "bedrock-agentcore:RetrieveMemoryRecords",
                          - "bedrock-agentcore:ListSessions",
                          - "bedrock-agentcore:ListMemoryRecords",
                          - "bedrock-agentcore:ListActors",
                          - "bedrock-agentcore:GetMemoryRecord",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:bedrock-agentcore:us-east-1:239388734812:memory/dsp_agent_tf_memory-lRHahyCGis"
                    },
                  - {
                      - Action   = [
                          - "bedrock-agentcore:ListSessions",
                          - "bedrock-agentcore:ListEvents",
                          - "bedrock-agentcore:ListActors",
                          - "bedrock-agentcore:GetEvent",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:bedrock-agentcore:us-east-1:239388734812:memory/dsp_agent_tf_memory-lRHahyCGis"
                    },
                  - {
                      - Action   = "bedrock-agentcore:CreateEvent"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:bedrock-agentcore:us-east-1:239388734812:memory/dsp_agent_tf_memory-lRHahyCGis"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dsp_agent.aws_iam_role_policy.xray will be updated in-place
  ~ resource "aws_iam_role_policy" "xray" {
        id     = "dsp-agent-tf-runtime-role:xray-tracing"
        name   = "xray-tracing"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.mcp_server[0].aws_bedrockagentcore_agent_runtime.mcp_server will be updated in-place
  ~ resource "aws_bedrockagentcore_agent_runtime" "mcp_server" {
      ~ agent_runtime_version     = "20" -> (known after apply)
        tags                      = {
            "Component" = "mcp-server"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (9 unchanged attributes hidden)

      ~ agent_runtime_artifact {
          ~ container_configuration {
              ~ container_uri = "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/mcp-server:da86209" -> "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/mcp-server:87b2f65"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.research_agent[0].aws_bedrockagentcore_agent_runtime.this will be updated in-place
  ~ resource "aws_bedrockagentcore_agent_runtime" "this" {
      ~ agent_runtime_version     = "12" -> (known after apply)
        tags                      = {
            "Agent"     = "research-agent-tf"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (10 unchanged attributes hidden)

      ~ agent_runtime_artifact {
          ~ container_configuration {
              ~ container_uri = "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/research-agent:da86209" -> "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/research-agent:87b2f65"
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.ui[0].data.archive_file.lambda will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/ui/lambda.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                import json
                import boto3
                import os
                import uuid
                from typing import Any
                
                client = boto3.client('bedrock-agentcore')
                
                # Runtime ARNs from environment
                RUNTIME_ARNS = json.loads(os.environ.get('RUNTIME_ARNS', '{}'))
                
                def handler(event: dict[str, Any], context: Any) -> dict[str, Any]:
                    """Proxy requests to Bedrock AgentCore runtimes."""
                
                    # CORS headers
                    headers = {
                        'Access-Control-Allow-Origin': '*',
                        'Access-Control-Allow-Headers': 'Content-Type,Authorization',
                        'Access-Control-Allow-Methods': 'GET,POST,OPTIONS',
                        'Content-Type': 'application/json'
                    }
                
                    # Handle preflight
                    if event.get('httpMethod') == 'OPTIONS':
                        return {
                            'statusCode': 200,
                            'headers': headers,
                            'body': ''
                        }
                
                    try:
                        # Support both API Gateway v1 (REST) and v2 (HTTP) payload formats
                        path = event.get('rawPath') or event.get('path', '')
                        method = event.get('requestContext', {}).get('http', {}).get('method') or event.get('httpMethod', 'GET')
                        body = json.loads(event.get('body', '{}')) if event.get('body') else {}
                
                        # Build ID-to-ARN mapping (convert name to lowercase-dash ID)
                        def get_agent_id(name):
                            return name.lower().replace(' ', '-')
                
                        AGENT_ID_TO_ARN = {get_agent_id(name): arn for name, arn in RUNTIME_ARNS.items()}
                        AGENT_ID_TO_NAME = {get_agent_id(name): name for name in RUNTIME_ARNS.keys()}
                
                        # GET /agents - List available agents
                        if path == '/agents' and method == 'GET':
                            agents = []
                            for name, arn in RUNTIME_ARNS.items():
                                agents.append({
                                    'id': get_agent_id(name),
                                    'name': name,
                                    'runtime_arn': arn,
                                    'status': 'active'
                                })
                
                            return {
                                'statusCode': 200,
                                'headers': headers,
                                'body': json.dumps({'agents': agents})
                            }
                
                        # POST /invoke - Invoke an agent
                        if path == '/invoke' and method == 'POST':
                            agent_id = body.get('agent_id')
                            input_text = body.get('input', '')
                            # Generate session ID with minimum 33 chars (uuid.hex = 32 chars)
                            session_id = body.get('session_id') or f"s-{uuid.uuid4().hex}"
                
                            # Extract authenticated user from JWT claims (set by API Gateway authorizer)
                            # Falls back to body.user_id or default for unauthenticated requests
                            jwt_claims = event.get('requestContext', {}).get('authorizer', {}).get('jwt', {}).get('claims', {})
                            user_id = jwt_claims.get('sub') or jwt_claims.get('email') or body.get('user_id', 'anonymous-user')
                
                            # Log authenticated user for audit
                            if jwt_claims:
                                print(f"Authenticated request from user: {user_id}")
                
                            if not agent_id or agent_id not in AGENT_ID_TO_ARN:
                                return {
                                    'statusCode': 400,
                                    'headers': headers,
                                    'body': json.dumps({
                                        'error': f'Invalid agent_id: {agent_id}',
                                        'available': list(AGENT_ID_TO_ARN.keys())
                                    })
                                }
                
                            runtime_arn = AGENT_ID_TO_ARN[agent_id]
                
                            # Build payload for AgentCore
                            payload = {
                                'input': input_text,
                                'user_id': user_id,
                                'session_id': session_id,
                                'stream': False
                            }
                
                            # Invoke AgentCore runtime
                            invoke_params = {
                                'agentRuntimeArn': runtime_arn,
                                'runtimeSessionId': session_id,
                                'payload': json.dumps(payload)
                            }
                
                            response = client.invoke_agent_runtime(**invoke_params)
                
                            # Parse non-streaming response
                            response_body = response['response'].read()
                            response_data = json.loads(response_body)
                
                            # Log full response for debugging
                            print(f"AgentCore response: {json.dumps(response_data)}")
                
                            # Extract output from response (structure may vary)
                            output = response_data.get('output', '')
                            if not output and 'text' in response_data:
                                output = response_data['text']
                            if not output and 'content' in response_data:
                                output = response_data['content']
                            if not output:
                                # If still no output, return the whole response for debugging
                                output = json.dumps(response_data)
                
                            result = {
                                'output': output,
                                'session_id': session_id,
                            }
                
                            return {
                                'statusCode': 200,
                                'headers': headers,
                                'body': json.dumps(result)
                            }
                
                        # Default 404
                        return {
                            'statusCode': 404,
                            'headers': headers,
                            'body': json.dumps({'error': 'Not found'})
                        }
                
                    except Exception as e:
                        import traceback
                        error_details = traceback.format_exc()
                        print(f"Error: {error_details}")
                        return {
                            'statusCode': 500,
                            'headers': headers,
                            'body': json.dumps({'error': str(e), 'details': error_details})
                        }
            EOT
          + filename = "index.py"
        }
    }

  # module.ui[0].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.ui[0].data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.ui[0].aws_apigatewayv2_authorizer.jwt[0] will be updated in-place
  ~ resource "aws_apigatewayv2_authorizer" "jwt" {
        id                               = "twa4ac"
        name                             = "cognito-jwt"
        # (6 unchanged attributes hidden)

      ~ jwt_configuration {
          ~ issuer   = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_0Och8G0S2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ui[0].aws_cloudfront_distribution.ui will be updated in-place
  ~ resource "aws_cloudfront_distribution" "ui" {
        id                             = "E1N79FYP07LOK"
        tags                           = {
            "Component" = "ui"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (21 unchanged attributes hidden)

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "agent-ui-tf-239388734812.s3-website-us-east-1.amazonaws.com" -> null
          - origin_id                   = "S3-Website" -> null
          - response_completion_timeout = 0 -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_id                   = "S3-Website"
          + response_completion_timeout = (known after apply)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.ui[0].aws_lambda_function.proxy will be updated in-place
  ~ resource "aws_lambda_function" "proxy" {
        id                             = "agent-ui-tf-proxy"
      ~ last_modified                  = "2026-02-03T12:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "yPoYBEbkZmjRcMCQtw2ke2zoAj0uFmquUoJpyK3+3dg=" -> (known after apply)
        tags                           = {
            "Component" = "ui"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ui[0].aws_s3_bucket.ui must be replaced
-/+ resource "aws_s3_bucket" "ui" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::agent-ui-tf-239388734812" -> (known after apply)
      ~ bucket                      = "agent-ui-tf-239388734812" # forces replacement -> (known after apply) # forces replacement
      ~ bucket_domain_name          = "agent-ui-tf-239388734812.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_region               = "us-east-1" -> (known after apply)
      ~ bucket_regional_domain_name = "agent-ui-tf-239388734812.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "agent-ui-tf-239388734812" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::agent-ui-tf-239388734812/*"
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Component" = "ui"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "agent-ui-tf-239388734812.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "1d215056988487726f2f10a05f64cf478b43d6b09f3429c204f2aaa605419440" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "index.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.ui[0].aws_s3_bucket_policy.ui must be replaced
-/+ resource "aws_s3_bucket_policy" "ui" {
      ~ bucket = "agent-ui-tf-239388734812" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "agent-ui-tf-239388734812" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::agent-ui-tf-239388734812/*"
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ui[0].aws_s3_bucket_public_access_block.ui must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "ui" {
      ~ bucket                  = "agent-ui-tf-239388734812" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "agent-ui-tf-239388734812" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ui[0].aws_s3_bucket_website_configuration.ui must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "ui" {
      ~ bucket           = "agent-ui-tf-239388734812" # forces replacement -> (known after apply) # forces replacement
      ~ id               = "agent-ui-tf-239388734812" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "agent-ui-tf-239388734812.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 14 to change, 4 to destroy.

Changes to Outputs:
  ~ ui_bucket_name                = "agent-ui-tf-239388734812" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @iker592, Action: `pull_request`*